app/controllers/cars_controller.rb

    def create_car

        id_car=params[:id]

        @cars = Car.new if id_car.blank?
        @cars = Car.find(id_car) if !id_car.blank?
        @cars.name_car = params[:name_car]
        @cars.description = params[:description]
        @cars.model = params[:model]
        @cars.hour_cost = params[:hour_cost]
        @cars.review = 0
        @cars.rent_status = "Available" if
        @cars.user_id = current_user.id
        @cars.save

        image=nil
        # with AWS image = save_file(params[:photo],'images_car', @cars.id) if id_car.blank?
        image = save_file(params[:photo],'images_car',@cars.id) if id_car.blank?
---
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
INSERT INTO `cars` (`name_car`, `description`, `model`, `hour_cost`, `review`, `rent_status`, `user_id`, `created_at`, `updated_at`) VALUES ('6', '665465456', '6', 6, 0.0, 'Available', 1, '2022-09-23 23:33:06.868746', '2022-09-23 23:33:06.868746')
UPDATE `cars` SET `cars`.`review` = 0.0, `cars`.`rent_status` = 'Available', `cars`.`updated_at` = '2022-11-06 01:45:01.145734' WHERE `cars`.`id` = 37
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def reserve_car

        rent_id = params[:rent_id]

        validate_user = nil
        validate_user = CarHasRent.where("user_id=? and rent_status='Activated' ", current_user.id) if rent_id.blank?

        if validate_user.blank?

            cost_rent = params[:cost_rent].to_i


            rent_date = params[:date_from]
            rent_date_to = params[:date_to]
            @rent_car = CarHasRent.find(rent_id) if !rent_id.blank?

            id_car = params[:id_car]
            id_car = @rent_car.car_id if params[:id_car].blank?
            hours = params[:rent_hours].to_i

            @cars = Car.find(id_car) if !id_car.blank?
            @cars.rent_status = "Not Available"
            @cars.save

            img_car = CarImg.select('url_img').where('cars_id=?',@cars.id).take

            @rent_car = CarHasRent.new if rent_id.blank?
---
SELECT `car_has_rents`.* FROM `car_has_rents` WHERE (user_id=1 and rent_status='Activated' )
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
UPDATE `cars` SET `cars`.`rent_status` = 'Not Available', `cars`.`updated_at` = '2022-11-05 19:47:37.728870' WHERE `cars`.`id` = 37
SELECT `car_imgs`.`url_img` FROM `car_imgs` WHERE (cars_id=37) ORDER BY `car_imgs`.`id` ASC LIMIT 1

    def cancel_reserve

        rent_id=params[:rent_id]
        rent = CarHasRent.where("id=?", rent_id).take

        if !rent.blank?

            car = Car.find(rent.car_id)
            car.rent_status = "Available"
            car.save

            rent_car = CarHasRent.find(rent.id)
            rent_car.rent_status = "Canceled"
            rent_car.save
---
SELECT `car_has_rents`.* FROM `car_has_rents` WHERE `car_has_rents`.`id` = 4 LIMIT 1
SELECT `car_has_rents`.* FROM `car_has_rents` WHERE (id='4') LIMIT 1
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
UPDATE `cars` SET `cars`.`rent_status` = 'Available', `cars`.`updated_at` = '2022-11-05 20:07:49.670204' WHERE `cars`.`id` = 37
UPDATE `car_has_rents` SET `car_has_rents`.`rent_status` = 'Canceled', `car_has_rents`.`updated_at` = '2022-11-05 20:07:49.708610' WHERE `car_has_rents`.`id` = 4

    def review

        rent_id =params[:rent_id]
        cars_review = CarHasRent.where("id=?", rent_id).take

        review_car = params[:review_car].to_i
        cars_review.review = review_car
        cars_review.save

        car = Car.find(cars_review.car_id)
        rents = CarHasRent.where("car_id=? and review is not null",car.id)
        actual_reviews = (rents.map{|x| x["review"].to_f}).sum
        qty_rents = rents.count.to_f
        review_final = (actual_reviews/qty_rents ).to_f
        car.review = review_final
        car.save
---
SELECT `car_has_rents`.* FROM `car_has_rents` WHERE (id='5') LIMIT 1
UPDATE `cars` SET `cars`.`review` = 4.0, `cars`.`updated_at` = '2022-11-05 20:08:46.077429' WHERE `cars`.`id` = 37
UPDATE `car_has_rents` SET `car_has_rents`.`review` = 4.0, `car_has_rents`.`updated_at` = '2022-11-05 20:08:46.035403' WHERE `car_has_rents`.`id` = 5
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
SELECT COUNT(*) FROM `car_has_rents` WHERE (car_id=37 and review is not null)
SELECT `car_has_rents`.* FROM `car_has_rents` WHERE (car_id=37 and review is not null)

    def my_car

        @my_cars=Car.where("user_id=?",current_user.id).as_json

        cars_image = CarImg.all

        @my_cars.each do |car|
            photo = cars_image.select{|p| p['cars_id'] == car['id'] }
---
SELECT `cars`.* FROM `cars` WHERE (user_id=1)
SELECT `car_imgs`.* FROM `car_imgs`

    def edit_car
        id_car=params[:id]
        @cars = Car.find(id_car) if !id_car.blank?
        @imagecar = CarImg.where('cars_id=?', @cars.id).take
---
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
SELECT `car_imgs`.* FROM `car_imgs` WHERE (cars_id=37) LIMIT 1

    def index
        @cars = Car.where("rent_status = 'Available'").as_json
        @cars_image = CarImg.all

        @cars.each do |car|
            photo = @cars_image.select{|p| p['cars_id'] == car['id'] }
---
SELECT `cars`.* FROM `cars` WHERE (rent_status = 'Available')
SELECT `car_imgs`.* FROM `car_imgs`

    def my_rent
        @rents=CarHasRent.getrents.where('car_has_rents.user_id=?',current_user.id)
        rents=@rents.where('car_has_rents.rent_status = "Activated"').take
        time_end = Time.now.strftime('%F').to_date

        if !rents.blank?
            if rents.rent_date_to < time_end
                cars = Car.where("id = ?",rents.car_id).take
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 25 LIMIT 1

    def view_car
        id_car = params[:id]
        @cars = Car.find(id_car) if !id_car.blank?
        @img_view_car = CarImg.where('cars_id=?', id_car).first
---
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 37 LIMIT 1
SELECT `car_imgs`.* FROM `car_imgs` WHERE (cars_id='37') ORDER BY `car_imgs`.`id` ASC LIMIT 1

    def save_file(file,folder_img,car_id)
            ########SAVE images
            folder = "#{Rails.root}/public/#{folder_img}"
            name_file = (Time.new.to_s+'_'+file.original_filename).gsub(' ','')
            path = File.join(folder, name_file)
            File.open(path, "wb") { |f| f.write(file.read) };
            ################
            path_save = '/'+folder_img+'/'+name_file
            photo = CarImg.new
            photo.url_img = path_save
            photo.cars_id = car_id
            photo.save
---
INSERT INTO `car_imgs` (`url_img`, `cars_id`, `created_at`, `updated_at`) VALUES ('/images_car/2022-11-0515:55:27-0500_react.png', 38, '2022-11-05 20:55:27.802775', '2022-11-05 20:55:27.802775')