app/views/cars/edit_car.html.erb

SELECT `car_imgs`.* FROM `car_imgs` WHERE (cars_id=37) LIMIT 1
---
							<tr><h1 style="color:#ffffff;">New Car</h1></tr>
							<tr><p align="center"><img src="<%= !@cars.blank? ?  @imagecar.url_img : '' %>" class='img_cars'></p></tr>